Revit 2024 API
EnergyAnalysisDetailModelOptions Constructor
 Constructs default options for energy analysis detailed model creation.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public EnergyAnalysisDetailModelOptions()
Visual Basic
Public Sub New
Visual C++
public:
EnergyAnalysisDetailModelOptions()
See Also
EnergyAnalysisDetailModelOptions Class
Autodesk.Revit.DB.Analysis Namespace